pmo-dataset/variations/mermaid_with_ids/09.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Discard prototype"]
	Task_2["Identify idea for\nnew product or\nimprovement"]
	Task_3["Collect feedback\nfrom testing phase"]
	Task_4["Test market\npotential"]
	Task_5["Refine prototype"]
	Task_6["Test functionality"]
	Task_7["Approve prototype\nfor further\ndevelopment"]
	Task_8["Select promising\ndesign"]
	Task_9["Conduct initial\nresearch"]
	Task_10["Draft design\nconcepts"]
	Task_11["Test safety"]
	Task_12["Conduct feasibility\nstudies"]
	Task_13["Build prototype"]
	StartNoneEvent_1(("start"))
	EndNoneEvent_1(("end")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"X"}
	ExclusiveGateway_4{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}
	ParallelGateway_3{"+"}
	ParallelGateway_4{"+"}

	StartNoneEvent_1 --> Task_2
	ParallelGateway_1 --> Task_12
	Task_11 --> ParallelGateway_2
	Task_5 --> ExclusiveGateway_4
	Task_7 --> ExclusiveGateway_2
	Task_2 --> ParallelGateway_1
	ParallelGateway_1 --> Task_9
	Task_9 --> ParallelGateway_4
	ExclusiveGateway_4 --> ParallelGateway_3
	ExclusiveGateway_3 --> Task_1
	ParallelGateway_3 --> Task_6
	ExclusiveGateway_3 --> Task_7
	Task_12 --> ParallelGateway_4
	ParallelGateway_3 --> Task_11
	ExclusiveGateway_1 --> Task_5
	ExclusiveGateway_1 --> ExclusiveGateway_3
	ParallelGateway_3 --> Task_4
	Task_8 --> Task_13
	Task_13 --> ExclusiveGateway_4
	ExclusiveGateway_2 --> EndNoneEvent_1
	ParallelGateway_4 --> Task_10
	Task_3 --> ExclusiveGateway_1
	ParallelGateway_2 --> Task_3
	Task_10 --> Task_8
	Task_6 --> ParallelGateway_2
	Task_4 --> ParallelGateway_2
	Task_1 --> ExclusiveGateway_2
